In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0031201.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(25, 8)

In [7]:
df.head(5)

         0     1                 2            3               4   5   6   7
0      NaN   NaN  Mckinney  14,256  Smith 8,724  Totals  22,980 NaN NaN NaN
1      NaN   NaN             62.0%        38.0%          100.0% NaN NaN NaN
2   County   PPR               NaN          NaN             NaN NaN NaN NaN
3  BALDWIN  100%               621          652            1273 NaN NaN NaN
4  BULLOCH  100%              1912         1494            3406 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

         0     1     2     3     4   5   6   7
3  BALDWIN  100%   621   652  1273 NaN NaN NaN
4  BULLOCH  100%  1912  1494  3406 NaN NaN NaN
5    BURKE  100%   605   196   801 NaN NaN NaN
6  CANDLER  100%   461   125   586 NaN NaN NaN
7  CHATHAM  100%  2412  1862  4274 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

         0     2     3
3  BALDWIN   621   652
4  BULLOCH  1912  1494
5    BURKE   605   196
6  CANDLER   461   125
7  CHATHAM  2412  1862

In [14]:
df.columns = ['county', 'Raymond McKinney', 'Carl Smith']

In [15]:
df.tail(5)

        county Raymond McKinney Carl Smith
20    TATTNALL              489        466
21      TOOMBS             1334        196
22    TREUTLEN              120         49
23      WARREN              148         65
24  WASHINGTON              199        343

In [16]:
df = df.melt(id_vars=['county'])

In [17]:
df.columns = ['county', 'candidate', 'votes']

In [18]:
df.head()

    county         candidate votes
0  BALDWIN  Raymond McKinney   621
1  BULLOCH  Raymond McKinney  1912
2    BURKE  Raymond McKinney   605
3  CANDLER  Raymond McKinney   461
4  CHATHAM  Raymond McKinney  2412

In [19]:
df['votes'] = df['votes'].astype(int)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
county       44 non-null object
candidate    44 non-null object
votes        44 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [21]:
df['office'] = 'U.S. Representative'

In [22]:
df['district'] = '12'

In [23]:
df['party'] = 'Republican'

In [24]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Carl Smith        Republican     8724
Raymond McKinney  Republican    14256
Name: votes, dtype: int64

In [25]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party         candidate  votes
0  BALDWIN  U.S. Representative       12  Republican  Raymond McKinney    621
1  BULLOCH  U.S. Representative       12  Republican  Raymond McKinney   1912
2    BURKE  U.S. Representative       12  Republican  Raymond McKinney    605
3  CANDLER  U.S. Representative       12  Republican  Raymond McKinney    461
4  CHATHAM  U.S. Representative       12  Republican  Raymond McKinney   2412

In [26]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')